app/controllers/guests_controller.rb

  def index
    @guests = Guest.all
---
SELECT `guests`.* FROM `guests`

  def show
    @guest = Guest.find(params[:id])
    @guests = Guest.all
---
SELECT `guests`.* FROM `guests` WHERE `guests`.`id` = 1 LIMIT 1
SELECT `guests`.* FROM `guests`

  def new
    @guest = Guest.new
    @guests = Guest.all
---
SELECT `guests`.* FROM `guests`

  def create
    @guest = Guest.new(params[:guest])
    respond_to do |format|
      if verify_captcha(@guest) &&  @guest.save
---
INSERT INTO `guests` (`attending`, `cell_num`, `created_at`, `name`, `sex`, `updated_at`) VALUES (0, 'Gupta', '2012-12-08 11:26:08', 'Ankit', 'male', '2012-12-08 11:26:08')